In [1]:
from pydataset import data
import pandas as pd

In [2]:
df_iris = data('iris')
# print the first 3 rows
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [3]:
# print the number of rows and columns (shape)
df_iris.shape

(150, 5)

In [4]:
# print the column names
df_iris.columns.to_list()

['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width', 'Species']

In [5]:
# print the data type of each column
df_iris.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [6]:
# print the summary statistics for each of the numeric variables
stats = df_iris.describe().T
stats

              count      mean       std  min  25%   50%  75%  max
Sepal.Length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
Sepal.Width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
Petal.Length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
Petal.Width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5

In [7]:
df_google_sheets = pd.read_excel('spreadsheet.xlsx', sheet_name='Table1_CustDetails')
df_google_sheets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7049 entries, 0 to 7048
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        7049 non-null   object
 1   gender             7049 non-null   object
 2   is_senior_citizen  7049 non-null   float64
 3   partner            7049 non-null   object
 4   dependents         7049 non-null   object
 5   phone_service      7049 non-null   float64
 6   internet_service   7049 non-null   float64
 7   contract_type      7049 non-null   float64
 8   payment_type       7049 non-null   object
 9   monthly_charges    7049 non-null   float64
 10  total_charges      7038 non-null   float64
 11  churn              7049 non-null   object
 12  tenure             7049 non-null   float64
dtypes: float64(7), object(6)
memory usage: 716.0+ KB

In [8]:
# assign the first 100 rows to a new dataframe, df_google_sheets_sample
df_google_sheets_sample = df_google_sheets.head(100)
df_google_sheets_sample.shape

(100, 13)

In [9]:
# print the number of rows of your original dataframe
df_iris.shape[0]

150

In [10]:
# print the first 5 column names
df_google_sheets.columns[:5]

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents'], dtype='object')

In [11]:
# print the column names that have a data type of object
df_google_sheets.select_dtypes(include='object').columns.tolist()

['customer_id', 'gender', 'partner', 'dependents', 'payment_type', 'churn']

In [12]:
# compute the range for each of the numeric variables.
number_var = df_google_sheets[['monthly_charges', 'total_charges']].describe().T
number_var['range'] = number_var['max'] - number_var['min']
number_var

,count,mean,std,min,25%,50%,75%,max,range
monthly_charges,7049.0,64.747014,30.099460,18.25,35.4500,70.35,89.850,118.75,100.5
total_charges,7038.0,2283.043883,2266.521984,18.80,401.5875,1397.10,3793.775,8684.80,8666.0

In [13]:
# print the unique values for each of your categorical variables
# I could get a count of unique values for each variable with an object data type.

for col in df_google_sheets.columns:
#     print(col)
    if df_google_sheets[col].dtypes == 'object':
        print(f'{col} has {df_google_sheets[col].nunique()} unique values.')

customer_id has 7043 unique values.
gender has 2 unique values.
partner has 2 unique values.
dependents has 2 unique values.
payment_type has 4 unique values.
churn has 2 unique values.

In [14]:
import acquire #save it in classification folder

In [15]:
titanic_df = acquire.get_titanic_data()
titanic_df.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [16]:
iris_df = acquire.get_iris_data()
iris_df.head()

,species_id,species_name,sepal_length,sepal_width,petal_length,petal_width,measurement_id
0,1,setosa,5.1,3.5,1.4,0.2,1
1,1,setosa,4.9,3.0,1.4,0.2,2
2,1,setosa,4.7,3.2,1.3,0.2,3
3,1,setosa,4.6,3.1,1.5,0.2,4
4,1,setosa,5.0,3.6,1.4,0.2,5

In [17]:
telco_df = acquire.get_telco_data()
telco_df.head()

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,1,2,1,0004-TLHLJ,Male,0,No,No,4,Yes,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,Yes,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,Yes,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

## Exercises

The end product of this exercise should be the specified functions in a python script named `prepare.py`.
Do these in your `classification_exercises.ipynb` first, then transfer to the prepare.py file. 

This work should all be saved in your local `classification-exercises` repo. Then add, commit, and push your changes.

Using the Iris Data:  

1. Use the function defined in `acquire.py` to load the iris data.  

1. Drop the `species_id` and `measurement_id` columns.  

1. Rename the `species_name` column to just `species`.  

1. Create dummy variables of the species name. 

1. Create a function named `prep_iris` that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [18]:
df_iris = acquire.get_iris_data()
df_iris.head()

,species_id,species_name,sepal_length,sepal_width,petal_length,petal_width,measurement_id
0,1,setosa,5.1,3.5,1.4,0.2,1
1,1,setosa,4.9,3.0,1.4,0.2,2
2,1,setosa,4.7,3.2,1.3,0.2,3
3,1,setosa,4.6,3.1,1.5,0.2,4
4,1,setosa,5.0,3.6,1.4,0.2,5

In [19]:
columns_to_drop = ['species_id', 'measurement_id']
data = df_iris.drop(columns = columns_to_drop)
data.rename(columns = {'species_name':'species'}, inplace = True)
data.head()

  species  sepal_length  sepal_width  petal_length  petal_width
0  setosa           5.1          3.5           1.4          0.2
1  setosa           4.9          3.0           1.4          0.2
2  setosa           4.7          3.2           1.3          0.2
3  setosa           4.6          3.1           1.5          0.2
4  setosa           5.0          3.6           1.4          0.2

In [20]:
dummy_df = pd.get_dummies(data[['species']], dummy_na=False, drop_first=True)
dummy_df

     species_versicolor  species_virginica
0                     0                  0
1                     0                  0
2                     0                  0
3                     0                  0
4                     0                  0
5                     0                  0
6                     0                  0
7                     0                  0
8                     0                  0
9                     0                  0
10                    0                  0
11                    0                  0
12                    0                  0
13                    0                  0
14                    0                  0
15                    0                  0
16                    0                  0
17                    0                  0
18                    0                  0
19                    0                  0
20                    0                  0
21                    0                  0
22                    0                  0
23                    0                  0
24                    0                  0
25                    0                  0
26                    0                  0
27                    0                  0
28                    0                  0
29                    0                  0
30                    0                  0
31                    0                  0
32                    0                  0
33                    0                  0
34                    0                  0
35                    0                  0
36                    0                  0
37                    0                  0
38                    0                  0
39                    0                  0
40                    0                  0
41                    0                  0
42                    0                  0
43                    0                  0
44                    0                  0
45                    0                  0
46                    0                  0
47                    0                  0
48                    0                  0
49                    0                  0
50                    1                  0
51                    1                  0
52                    1                  0
53                    1                  0
54                    1                  0
55                    1                  0
56                    1                  0
57                    1                  0
58                    1                  0
59                    1                  0
60                    1                  0
61                    1                  0
62                    1                  0
63                    1                  0
64                    1                  0
65                    1                  0
66                    1                  0
67                    1                  0
68                    1                  0
69                    1                  0
70                    1                  0
71                    1                  0
72                    1                  0
73                    1                  0
74                    1                  0
75                    1                  0
76                    1                  0
77                    1                  0
78                    1                  0
79                    1                  0
80                    1                  0
81                    1                  0
82                    1                  0
83                    1                  0
84                    1                  0
85                    1                  0
86                    1                  0
87                    1                  0
88                    1                  0
89                    1                  0
90                    1                  0
91                    1                  0
92                    1                  0
93                    1                  0
94                    1                  0
95                    1                  0
96                    1                  0
97                    1                  0
98                    1                  0
99                    1                  0
100                   0                  1
101                   0                  1
102                   0                  1
103                   0                  1
104                   0                  1
105                   0                  1
106                   0                  1
107                   0                  1
108                   0                  1
109                   0                  1
110                   0                  1
111                   0                  1
112                   0                  1
113                   0                  1
114                   0                  1
115                   0                  1
116                   0                  1
117                   0                  1
118                   0                  1
119                   0                  1
120                   0                  1
121                   0                  1
122                   0                  1
123                   0                  1
124                   0                  1
125                   0                  1
126                   0                  1
127                   0                  1
128                   0                  1
129                   0                  1
130                   0                  1
131                   0                  1
132                   0                  1
133                   0                  1
134                   0                  1
135                   0                  1
136                   0                  1
137                   0                  1
138                   0                  1
139                   0                  1
140                   0                  1
141                   0                  1
142                   0                  1
143                   0                  1
144                   0                  1
145                   0                  1
146                   0                  1
147                   0                  1
148                   0                  1
149                   0                  1

In [21]:
def prep_iris(df):
    '''Prepares acquired Iris data for exploration'''
    
    # drop column using .drop(columns=column_name)
    df = df.drop(columns='species_id')
    
    # remame column using .rename(columns={current_column_name : replacement_column_name})
    df = df.rename(columns={'species_name':'species'})
    
    # create dummies dataframe using .get_dummies(column_name,not dropping any of the dummy columns)
    dummy_df = pd.get_dummies(df['species'], drop_first=False)
    
    # join original df with dummies df using .concat([original_df,dummy_df], join along the index)
    df = pd.concat([df, dummy_df], axis=1)
    
    # split data into train/validate/test using split_data function
    train, validate, test = split_iris_data(df)
    
    return train, validate, test

Using the Telco dataset

Use the function defined in acquire.py to load the Telco data.

Drop any unnecessary, unhelpful, or duplicated columns. This could mean dropping foreign key columns but keeping the corresponding string values, for example.

Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

Create a function named prep_telco that accepts the raw telco data, and returns the data with the transformations above applied.

In [23]:
df_telco = acquire.get_telco_data()
df_telco.head()

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,1,2,1,0004-TLHLJ,Male,0,No,No,4,Yes,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,Yes,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,Yes,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

In [ ]:
def prep_telco_data(df):
    # Drop duplicate columns
    df.drop(columns=['payment_type_id', 'internet_service_type_id', 'contract_type_id', 'customer_id'], inplace=True)
       
    # Drop null values stored as whitespace    
    df['total_charges'] = df['total_charges'].str.strip()
    df = df[df.total_charges != '']
    
    # Convert to correct datatype
    df['total_charges'] = df.total_charges.astype(float)
    
    # Convert binary categorical variables to numeric
    df['gender_encoded'] = df.gender.map({'Female': 1, 'Male': 0})
    df['partner_encoded'] = df.partner.map({'Yes': 1, 'No': 0})
    df['dependents_encoded'] = df.dependents.map({'Yes': 1, 'No': 0})
    df['phone_service_encoded'] = df.phone_service.map({'Yes': 1, 'No': 0})
    df['paperless_billing_encoded'] = df.paperless_billing.map({'Yes': 1, 'No': 0})
    df['churn_encoded'] = df.churn.map({'Yes': 1, 'No': 0})
    
    ## moved rest to prepare.py